# Cleaning Retail Sales Data

## Import Libraries

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Data Inspection

In [ ]:
df = pd.read_csv("/content/retail_store_sales.csv")

# Save original dataframe
orig_df = df.copy()

In [ ]:
# Number of rows and columns
print("Rows:", df.shape[0])
print("Columns:", df.shape[1])

Rows: 12575
Columns: 11

In [ ]:
# Column Names
df.columns.tolist()

['Transaction ID',
 'Customer ID',
 'Category',
 'Item',
 'Price Per Unit',
 'Quantity',
 'Total Spent',
 'Payment Method',
 'Location',
 'Transaction Date',
 'Discount Applied']

In [ ]:
# Missing Data
df.isna().sum()

Transaction ID         0
Customer ID            0
Category               0
Item                1213
Price Per Unit       609
Quantity             604
Total Spent          604
Payment Method         0
Location               0
Transaction Date       0
Discount Applied    4199
dtype: int64

In [ ]:
# Data Types
df.dtypes

Transaction ID       object
Customer ID          object
Category             object
Item                 object
Price Per Unit      float64
Quantity            float64
Total Spent         float64
Payment Method       object
Location             object
Transaction Date     object
Discount Applied     object
dtype: object

In [ ]:
# Statistical Summary
df.describe()

       Price Per Unit      Quantity   Total Spent
count    11966.000000  11971.000000  11971.000000
mean        23.365912      5.536380    129.652577
std         10.743519      2.857883     94.750697
min          5.000000      1.000000      5.000000
25%         14.000000      3.000000     51.000000
50%         23.000000      6.000000    108.500000
75%         33.500000      8.000000    192.000000
max         41.000000     10.000000    410.000000

## Cleaning

In [ ]:
# Column Headers
print("Original Headers:", df.columns.tolist())

df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_", regex=False)

print("Cleaned Headers:", df.columns.tolist())

Original Headers: ['Transaction ID', 'Customer ID', 'Category', 'Item', 'Price Per Unit', 'Quantity', 'Total Spent', 'Payment Method', 'Location', 'Transaction Date', 'Discount Applied']
Cleaned Headers: ['transaction_id', 'customer_id', 'category', 'item', 'price_per_unit', 'quantity', 'total_spent', 'payment_method', 'location', 'transaction_date', 'discount_applied']

In [ ]:
df

,transaction_id,customer_id,category,item,price_per_unit,quantity,total_spent,payment_method,location,transaction_date,discount_applied
0,TXN_6867343,CUST_09,Patisserie,Item_10_PAT,18.5,10.0,185.0,Digital Wallet,Online,2024-04-08,True
1,TXN_3731986,CUST_22,Milk Products,Item_17_MILK,29.0,9.0,261.0,Digital Wallet,Online,2023-07-23,True
2,TXN_9303719,CUST_02,Butchers,Item_12_BUT,21.5,2.0,43.0,Credit Card,Online,2022-10-05,False
3,TXN_9458126,CUST_06,Beverages,Item_16_BEV,27.5,9.0,247.5,Credit Card,Online,2022-05-07,NaN
4,TXN_4575373,CUST_05,Food,Item_6_FOOD,12.5,7.0,87.5,Digital Wallet,Online,2022-10-02,False
...,...,...,...,...,...,...,...,...,...,...,...
12570,TXN_9347481,CUST_18,Patisserie,Item_23_PAT,38.0,4.0,152.0,Credit Card,In-store,2023-09-03,NaN
12571,TXN_4009414,CUST_03,Beverages,Item_2_BEV,6.5,9.0,58.5,Cash,Online,2022-08-12,False
12572,TXN_5306010,CUST_11,Butchers,Item_7_BUT,14.0,10.0,140.0,Cash,Online,2024-08-24,NaN
12573,TXN_5167298,CUST_04,Furniture,Item_7_FUR,14.0,6.0,84.0,Cash,Online,2023-12-30,True
12574,TXN_2407494,CUST_23,Food,Item_9_FOOD,17.0,3.0,51.0,Cash,Online,2022-08-06,NaN

## Column Cleaning

### item

In [ ]:
df["item"]

0         Item_10_PAT
1        Item_17_MILK
2         Item_12_BUT
3         Item_16_BEV
4         Item_6_FOOD
             ...
12570     Item_23_PAT
12571      Item_2_BEV
12572      Item_7_BUT
12573      Item_7_FUR
12574     Item_9_FOOD
Name: item, Length: 12575, dtype: object

In [ ]:
# Sum of missing values
df["item"].isna().sum()

np.int64(1213)

In [ ]:
# Rows with missing 'item' value
df[df["item"].isna()]

,transaction_id,customer_id,category,item,price_per_unit,quantity,total_spent,payment_method,location,transaction_date,discount_applied
5,TXN_7482416,CUST_09,Patisserie,NaN,NaN,10.0,200.0,Credit Card,Online,2023-11-30,NaN
7,TXN_1372952,CUST_21,Furniture,NaN,33.5,NaN,NaN,Digital Wallet,In-store,2024-04-02,True
11,TXN_5422631,CUST_09,Milk Products,NaN,NaN,8.0,52.0,Digital Wallet,In-store,2025-01-12,True
15,TXN_1809665,CUST_14,Beverages,NaN,24.5,NaN,NaN,Credit Card,In-store,2022-05-11,NaN
17,TXN_9634894,CUST_15,Milk Products,NaN,NaN,10.0,275.0,Digital Wallet,Online,2022-04-17,NaN
...,...,...,...,...,...,...,...,...,...,...,...
12527,TXN_1069238,CUST_23,Food,NaN,5.0,NaN,NaN,Digital Wallet,In-store,2022-08-13,False
12552,TXN_4823896,CUST_05,Milk Products,NaN,8.0,NaN,NaN,Cash,In-store,2022-07-21,False
12556,TXN_4397672,CUST_04,Beverages,NaN,41.0,NaN,NaN,Credit Card,Online,2024-11-28,True
12562,TXN_7422454,CUST_07,Butchers,NaN,33.5,NaN,NaN,Cash,Online,2023-04-15,NaN
12564,TXN_2153066,CUST_17,Electric household essentials,NaN,29.0,NaN,NaN,Digital Wallet,In-store,2024-03-28,False

In [ ]:
#  Unique 'item' values
df["item"].unique()

array(['Item_10_PAT', 'Item_17_MILK', 'Item_12_BUT', 'Item_16_BEV',
       'Item_6_FOOD', nan, 'Item_1_FOOD', 'Item_16_FUR', 'Item_22_BUT',
       'Item_3_BUT', 'Item_2_FOOD', 'Item_24_PAT', 'Item_16_MILK',
       'Item_17_PAT', 'Item_13_EHE', 'Item_7_BEV', 'Item_4_EHE',
       'Item_10_FOOD', 'Item_14_FUR', 'Item_20_BUT', 'Item_25_FUR',
       'Item_14_FOOD', 'Item_22_PAT', 'Item_11_FOOD', 'Item_6_PAT',
       'Item_21_EHE', 'Item_25_BEV', 'Item_23_FOOD', 'Item_10_FUR',
       'Item_11_BEV', 'Item_23_BUT', 'Item_22_BEV', 'Item_10_EHE',
       'Item_24_BUT', 'Item_8_BEV', 'Item_3_FOOD', 'Item_12_FOOD',
       'Item_16_CEA', 'Item_11_PAT', 'Item_16_BUT', 'Item_5_CEA',
       'Item_19_MILK', 'Item_23_FUR', 'Item_7_FUR', 'Item_15_CEA',
       'Item_6_MILK', 'Item_24_CEA', 'Item_22_CEA', 'Item_22_FOOD',
       'Item_2_BUT', 'Item_14_PAT', 'Item_12_PAT', 'Item_18_FOOD',
       'Item_1_PAT', 'Item_4_BEV', 'Item_22_FUR', 'Item_7_PAT',
       'Item_20_CEA', 'Item_20_FOOD', 'Item_11_FUR', 'Item_25_PAT',
       'Item_7_FOOD', 'Item_21_FUR', 'Item_24_FUR', 'Item_8_MILK',
       'Item_4_FOOD', 'Item_14_BEV', 'Item_4_PAT', 'Item_4_MILK',
       'Item_7_CEA', 'Item_6_EHE', 'Item_21_BUT', 'Item_16_PAT',
       'Item_25_CEA', 'Item_8_BUT', 'Item_10_CEA', 'Item_5_FUR',
       'Item_9_FOOD', 'Item_21_CEA', 'Item_8_CEA', 'Item_8_EHE',
       'Item_23_MILK', 'Item_23_BEV', 'Item_19_BEV', 'Item_20_BEV',
       'Item_24_FOOD', 'Item_21_MILK', 'Item_6_BEV', 'Item_1_MILK',
       'Item_24_MILK', 'Item_2_CEA', 'Item_18_BUT', 'Item_1_FUR',
       'Item_3_MILK', 'Item_11_MILK', 'Item_13_CEA', 'Item_6_CEA',
       'Item_2_FUR', 'Item_21_BEV', 'Item_8_FUR', 'Item_13_BUT',
       'Item_2_BEV', 'Item_7_EHE', 'Item_14_CEA', 'Item_19_EHE',
       'Item_18_CEA', 'Item_11_CEA', 'Item_17_FUR', 'Item_15_MILK',
       'Item_20_EHE', 'Item_16_EHE', 'Item_23_EHE', 'Item_7_BUT',
       'Item_1_EHE', 'Item_19_CEA', 'Item_25_FOOD', 'Item_12_EHE',
       'Item_22_EHE', 'Item_13_PAT', 'Item_17_EHE', 'Item_25_BUT',
       'Item_4_CEA', 'Item_2_MILK', 'Item_1_BUT', 'Item_12_BEV',
       'Item_5_FOOD', 'Item_25_EHE', 'Item_9_CEA', 'Item_1_CEA',
       'Item_15_FUR', 'Item_15_PAT', 'Item_5_EHE', 'Item_1_BEV',
       'Item_17_BUT', 'Item_3_BEV', 'Item_13_FOOD', 'Item_11_EHE',
       'Item_9_MILK', 'Item_17_FOOD', 'Item_20_PAT', 'Item_9_PAT',
       'Item_10_BEV', 'Item_17_CEA', 'Item_8_PAT', 'Item_13_MILK',
       'Item_5_BUT', 'Item_22_MILK', 'Item_4_FUR', 'Item_17_BEV',
       'Item_19_PAT', 'Item_2_PAT', 'Item_14_BUT', 'Item_20_FUR',
       'Item_6_BUT', 'Item_9_FUR', 'Item_12_CEA', 'Item_15_EHE',
       'Item_5_PAT', 'Item_18_MILK', 'Item_6_FUR', 'Item_24_BEV',
       'Item_14_MILK', 'Item_12_FUR', 'Item_18_BEV', 'Item_23_CEA',
       'Item_24_EHE', 'Item_2_EHE', 'Item_23_PAT', 'Item_15_FOOD',
       'Item_8_FOOD', 'Item_15_BEV', 'Item_20_MILK', 'Item_9_EHE',
       'Item_11_BUT', 'Item_18_EHE', 'Item_5_MILK', 'Item_3_FUR',
       'Item_19_BUT', 'Item_3_CEA', 'Item_19_FUR', 'Item_7_MILK',
       'Item_9_BEV', 'Item_10_BUT', 'Item_18_FUR', 'Item_25_MILK',
       'Item_4_BUT', 'Item_15_BUT', 'Item_21_PAT', 'Item_21_FOOD',
       'Item_13_BEV', 'Item_5_BEV', 'Item_3_PAT', 'Item_13_FUR',
       'Item_18_PAT', 'Item_12_MILK', 'Item_10_MILK', 'Item_16_FOOD',
       'Item_19_FOOD', 'Item_14_EHE', 'Item_3_EHE', 'Item_9_BUT'],
      dtype=object)

In [ ]:
# Separate Item# and ItemCategory
splits = df["item"].str.split("_", expand=True)
splits.head()

      0   1     2
0  Item  10   PAT
1  Item  17  MILK
2  Item  12   BUT
3  Item  16   BEV
4  Item   6  FOOD

In [ ]:
# Insert new columns
df.insert(3, "item_id", splits[0] + "_" + splits[1])
df.insert(4, "item_category", splits[2])

# Drop old item column
df.drop(columns="item", inplace=True)

In [ ]:
#  View unique values
print("Before:")
print(df["item_id"].unique(),"\n")
print(df["item_category"].unique(),"\n")

# Replace NaN with 'Unknown'
df[["item_id", "item_category"]] = df[["item_id", "item_category"]].fillna("Unknown")

print("After:")
print(df["item_id"].unique(),"\n")
print(df["item_category"].unique())

Before:
['Item_10' 'Item_17' 'Item_12' 'Item_16' 'Item_6' nan 'Item_1' 'Item_22'
 'Item_3' 'Item_2' 'Item_24' 'Item_13' 'Item_7' 'Item_4' 'Item_14'
 'Item_20' 'Item_25' 'Item_11' 'Item_21' 'Item_23' 'Item_8' 'Item_5'
 'Item_19' 'Item_15' 'Item_18' 'Item_9']

['PAT' 'MILK' 'BUT' 'BEV' 'FOOD' nan 'FUR' 'EHE' 'CEA']

After:
['Item_10' 'Item_17' 'Item_12' 'Item_16' 'Item_6' 'Unknown' 'Item_1'
 'Item_22' 'Item_3' 'Item_2' 'Item_24' 'Item_13' 'Item_7' 'Item_4'
 'Item_14' 'Item_20' 'Item_25' 'Item_11' 'Item_21' 'Item_23' 'Item_8'
 'Item_5' 'Item_19' 'Item_15' 'Item_18' 'Item_9']

['PAT' 'MILK' 'BUT' 'BEV' 'FOOD' 'Unknown' 'FUR' 'EHE' 'CEA']

### price_per_unit, quantity, and total_spent

In [ ]:
df[df["quantity"].isna()]

,transaction_id,customer_id,category,item_id,item_category,price_per_unit,quantity,total_spent,payment_method,location,transaction_date,discount_applied
7,TXN_1372952,CUST_21,Furniture,Unknown,Unknown,33.5,NaN,NaN,Digital Wallet,In-store,2024-04-02,True
15,TXN_1809665,CUST_14,Beverages,Unknown,Unknown,24.5,NaN,NaN,Credit Card,In-store,2022-05-11,NaN
19,TXN_4206593,CUST_01,Furniture,Unknown,Unknown,35.0,NaN,NaN,Digital Wallet,Online,2025-01-13,False
25,TXN_3481599,CUST_05,Furniture,Unknown,Unknown,39.5,NaN,NaN,Cash,Online,2022-09-08,False
34,TXN_1621497,CUST_06,Patisserie,Unknown,Unknown,23.0,NaN,NaN,Cash,In-store,2023-02-18,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
12527,TXN_1069238,CUST_23,Food,Unknown,Unknown,5.0,NaN,NaN,Digital Wallet,In-store,2022-08-13,False
12552,TXN_4823896,CUST_05,Milk Products,Unknown,Unknown,8.0,NaN,NaN,Cash,In-store,2022-07-21,False
12556,TXN_4397672,CUST_04,Beverages,Unknown,Unknown,41.0,NaN,NaN,Credit Card,Online,2024-11-28,True
12562,TXN_7422454,CUST_07,Butchers,Unknown,Unknown,33.5,NaN,NaN,Cash,Online,2023-04-15,NaN
12564,TXN_2153066,CUST_17,Electric household essentials,Unknown,Unknown,29.0,NaN,NaN,Digital Wallet,In-store,2024-03-28,False

In [ ]:
# Do missing values occur together?
df[["price_per_unit", "quantity", "total_spent"]].isna().value_counts()

price_per_unit  quantity  total_spent
False           False     False          11362
True            False     False            609
False           True      True             604
Name: count, dtype: int64

In [ ]:
# Missing values
df[["price_per_unit", "quantity", "total_spent"]].isna().sum()

price_per_unit    609
quantity          604
total_spent       604
dtype: int64

### quantity

In [ ]:
df["quantity"].unique()

array([10.,  9.,  2.,  7.,  8., nan,  1.,  3.,  6.,  4.,  5.])

In [ ]:
# Fill missing with median amount
df["quantity"] = df["quantity"].fillna(df["quantity"].median())

In [ ]:
df.describe()

       price_per_unit      quantity   total_spent
count    11966.000000  12575.000000  11971.000000
mean        23.365912      5.558648    129.652577
std         10.743519      2.790160     94.750697
min          5.000000      1.000000      5.000000
25%         14.000000      3.000000     51.000000
50%         23.000000      6.000000    108.500000
75%         33.500000      8.000000    192.000000
max         41.000000     10.000000    410.000000

### price_per_unit

In [ ]:
print("Original Prices:", df["price_per_unit"].unique().tolist())

# Recover price from total-spent/quantity
item_price = df.groupby("item_id")["price_per_unit"].median()  # group by item_id, select price_per_unit column, and compute median for each item_id
df["price_per_unit"] = df["price_per_unit"].fillna(df["item_id"].map(item_price))  # fill with item_price if missing

print("Updated Prices:", df["price_per_unit"].unique().tolist())

Original Prices: [18.5, 29.0, 21.5, 27.5, 12.5, nan, 5.0, 33.5, 36.5, 8.0, 6.5, 39.5, 24.5, 23.0, 35.0, 14.0, 9.5, 41.0, 20.0, 38.0, 15.5, 11.0, 32.0, 26.0, 30.5, 17.0]
Updated Prices: [18.5, 29.0, 21.5, 27.5, 12.5, 23.0, 5.0, 33.5, 36.5, 8.0, 6.5, 39.5, 24.5, 35.0, 14.0, 9.5, 41.0, 20.0, 38.0, 15.5, 11.0, 32.0, 26.0, 30.5, 17.0]

### total_spent

In [ ]:
df["total_spent"]

0        185.0
1        261.0
2         43.0
3        247.5
4         87.5
         ...
12570    152.0
12571     58.5
12572    140.0
12573     84.0
12574     51.0
Name: total_spent, Length: 12575, dtype: float64

In [ ]:
df["total_spent"].unique()

array([185. , 261. ,  43. , 247.5,  87.5, 200. ,  40. ,   nan,  27.5,
       109.5,  72. ,  52. ,  45.5, 237. ,  55. , 232. , 275. ,  23. ,
       126. , 105. ,  66.5,  18.5,  49. , 134. , 410. , 245. , 182.5,
       100. , 196. , 315. , 287. ,  76. ,  92.5, 190. , 255.5, 276.5,
        46.5,   8. , 107.5, 165. ,  80. , 192.5, 335. ,  66. , 215. ,
        96. ,  42. ,  11. , 234. , 316. ,  82.5, 180. , 365. ,  39. ,
       172. , 122. ,  30. ,  84. , 320. , 219. ,  67. , 146. , 290. ,
        70. , 160. ,  82. ,  14. , 355.5, 124. ,  28.5,  47.5, 193.5,
        38. ,  12.5, 140. , 120. , 183. , 305. ,  41. , 155. ,  19.5,
        33. , 108.5, 119. , 280. ,  62. ,  32. , 380. , 304. , 139.5,
       114. , 192. , 167.5,  88. , 395. , 158. ,  25. ,  50. ,  32.5,
        15. ,  33.5,  24. , 111. ,  46. ,  36.5,  62.5, 161. ,  26. ,
        98. ,  85. , 228. ,  91.5,  93. ,  35. , 208. , 100.5,   9.5,
        10. , 138. , 288. ,  60. , 123. ,  73. , 197.5,  69. ,  61. ,
       116. ,  55.5,   6.5, 152.5, 118.5,  74. , 205. , 150.5, 110. ,
        19. ,  48. , 175. , 369. ,  37.5,  65. , 170. ,  77.5, 129.5,
        15.5,  24.5, 147. ,  21.5,  31. ,  99. , 128. ,  58.5, 266. ,
        29. , 268. ,  64. , 115. ,  64.5, 260. , 207. , 224. , 328. ,
        92. , 244. ,  39.5,  16. , 328.5, 182. ,  44. , 129. , 301.5,
        57. ,   5. , 122.5, 220. , 112.5,  68. , 292. ,  28. , 342. ,
       102. ,  77. , 148. , 125. , 210. , 137.5,  95. , 136. , 145. ,
       153. ,  79. ,  78. ,  51. , 256. , 152. , 230. , 274.5, 184. ,
       171.5,  20. ,  58. , 213.5, 203. , 104. , 201. , 234.5,  87. ,
        56. ,  86. ,  30.5,  85.5, 174. ,  22. ,  34. , 156. , 350. ,
        75. , 246. , 220.5, 166.5,  45. , 112. , 164. , 130. ,  37. ,
        73.5,  13. ,  17. ])

In [ ]:
df["total_spent"].describe()

count    11971.000000
mean       129.652577
std         94.750697
min          5.000000
25%         51.000000
50%        108.500000
75%        192.000000
max        410.000000
Name: total_spent, dtype: float64

In [ ]:
mask = (df["total_spent"].isna() &   # look for NaN rows
        df["quantity"].notna() &
        df["price_per_unit"].notna()
)

# Compute total spent for NaN rows
df.loc[mask, "total_spent"] = df.loc[mask, "quantity"] * df.loc[mask, "price_per_unit"]  # Updates rows where total_spent is missing

### discount_applied

In [ ]:
# View column
df["discount_applied"]

0         True
1         True
2        False
3          NaN
4        False
         ...
12570      NaN
12571    False
12572      NaN
12573     True
12574      NaN
Name: discount_applied, Length: 12575, dtype: object

In [ ]:
# Fill NaN with False (no discount applied)
df["discount_applied"] = df["discount_applied"].astype(bool)
df["discount_applied"] = df["discount_applied"].fillna(False)

### Check other columns

### category

In [ ]:
# Check value counts
df["category"].value_counts()

category
Electric household essentials         1591
Furniture                             1591
Food                                  1588
Milk Products                         1584
Butchers                              1568
Beverages                             1567
Computers and electric accessories    1558
Patisserie                            1528
Name: count, dtype: int64

In [ ]:
# Missing values
df["category"].isna().sum()

np.int64(0)

### payment_method

In [ ]:
# Missing values
df["payment_method"].isna().sum()

np.int64(0)

In [ ]:
# View value counts
df["payment_method"].value_counts()

payment_method
Cash              4310
Digital Wallet    4144
Credit Card       4121
Name: count, dtype: int64

### location

In [ ]:
# Missing values
df["location"].isna().sum()

np.int64(0)

In [ ]:
# Value counts
df["location"].value_counts()

location
Online      6354
In-store    6221
Name: count, dtype: int64

### transaction_date

In [ ]:
# Missing values
df["transaction_date"].isna().sum()

np.int64(0)

In [ ]:
# View first 10 unique values
df["transaction_date"].unique()[:10]

array(['2024-04-08', '2023-07-23', '2022-10-05', '2022-05-07',
       '2022-10-02', '2023-11-30', '2023-06-10', '2024-04-02',
       '2023-04-26', '2024-03-14'], dtype=object)

## Data Conversion

In [ ]:
# Data Types
df.dtypes

transaction_id       object
customer_id          object
category             object
item_id              object
item_category        object
price_per_unit      float64
quantity            float64
total_spent         float64
payment_method       object
location             object
transaction_date     object
discount_applied       bool
dtype: object

In [ ]:
# Convert categorical columns to category data type
categorical_cols = ["category", "item_category", "payment_method", "location"]
df[categorical_cols]  = df[categorical_cols].astype("category")

# Convert quantity to numeric
df["quantity"] = df["quantity"].astype(int)

# Convert transaction_date to datetime
df["transaction_date"] = pd.to_datetime(df["transaction_date"], errors="coerce")

## Final Inspection

In [ ]:
# Check for outlier dates
print(df["transaction_date"].min())
print(df["transaction_date"].max())

2022-01-01 00:00:00
2025-01-18 00:00:00

In [ ]:
df["transaction_date"].dt.year.value_counts()

transaction_date
2024    4241
2022    4134
2023    3987
2025     213
Name: count, dtype: int64

In [ ]:
# View shape
df.shape

(12575, 12)

In [ ]:
# View column headers
df.columns.to_list()

['transaction_id',
 'customer_id',
 'category',
 'item_id',
 'item_category',
 'price_per_unit',
 'quantity',
 'total_spent',
 'payment_method',
 'location',
 'transaction_date',
 'discount_applied']

In [ ]:
# Data types
df.dtypes

transaction_id              object
customer_id                 object
category                  category
item_id                     object
item_category             category
price_per_unit             float64
quantity                     int64
total_spent                float64
payment_method            category
location                  category
transaction_date    datetime64[ns]
discount_applied              bool
dtype: object

In [ ]:
# Missing values
df.isna().sum()

transaction_id      0
customer_id         0
category            0
item_id             0
item_category       0
price_per_unit      0
quantity            0
total_spent         0
payment_method      0
location            0
transaction_date    0
discount_applied    0
dtype: int64

In [ ]:
# Statistical summary of numerical columns
df.describe()

,price_per_unit,quantity,total_spent,transaction_date
count,12575.000000,12575.000000,12575.000000,12575
mean,23.348191,5.558648,130.208111,2023-07-12 20:23:41.105368064
min,5.000000,1.000000,5.000000,2022-01-01 00:00:00
25%,14.000000,3.000000,52.000000,2022-09-30 00:00:00
50%,23.000000,6.000000,110.000000,2023-07-13 00:00:00
75%,32.000000,8.000000,192.000000,2024-04-24 00:00:00
max,41.000000,10.000000,410.000000,2025-01-18 00:00:00
std,10.480413,2.790160,93.580667,NaN

In [ ]:
# View value counts
df["category"].value_counts()

category
Electric household essentials         1591
Furniture                             1591
Food                                  1588
Milk Products                         1584
Butchers                              1568
Beverages                             1567
Computers and electric accessories    1558
Patisserie                            1528
Name: count, dtype: int64

In [ ]:
df["item_category"].value_counts()

item_category
FUR        1460
EHE        1437
BEV        1427
FOOD       1426
MILK       1425
BUT        1421
CEA        1397
PAT        1369
Unknown    1213
Name: count, dtype: int64

In [ ]:
df["payment_method"].value_counts()

payment_method
Cash              4310
Digital Wallet    4144
Credit Card       4121
Name: count, dtype: int64

In [ ]:
df["location"].value_counts()

location
Online      6354
In-store    6221
Name: count, dtype: int64

In [ ]:
# Check for duplicate rows
df.duplicated().sum()

np.int64(0)

In [ ]:
# Key-based duplicates
df.duplicated(subset=["transaction_id"]).sum()

np.int64(0)

## Save Cleaned Dataframe

In [ ]:
# Save final dataframe
cleaned_df = df.copy()

cleaned_df.to_csv("retail_data_cleaned.csv", index=False)